robbyrussell/oh-my-zsh
robbyrussell/oh-my-zsh path:plugins/common-aliases
robbyrussell/oh-my-zsh path:plugins/aws
robbyrussell/oh-my-zsh path:plugins/brew
robbyrussell/oh-my-zsh path:plugins/osx
robbyrussell/oh-my-zsh path:plugins/colored-man-pages
robbyrussell/oh-my-zsh path:plugins/colorize
robbyrussell/oh-my-zsh path:plugins/command-not-found
robbyrussell/oh-my-zsh path:plugins/encode64
robbyrussell/oh-my-zsh path:plugins/nmap
robbyrussell/oh-my-zsh path:plugins/node
robbyrussell/oh-my-zsh path:plugins/httpie
robbyrussell/oh-my-zsh path:plugins/rake
robbyrussell/oh-my-zsh path:plugins/rsync
robbyrussell/oh-my-zsh path:plugins/screen
robbyrussell/oh-my-zsh path:plugins/sublime
robbyrussell/oh-my-zsh path:plugins/vagrant
robbyrussell/oh-my-zsh path:plugins/systemd
robbyrussell/oh-my-zsh path:plugins/ruby
robbyrussell/oh-my-zsh path:plugins/chruby
robbyrussell/oh-my-zsh path:plugins/bower
robbyrussell/oh-my-zsh path:plugins/bundler
robbyrussell/oh-my-zsh path:plugins/ubuntu
robbyrussell/oh-my-zsh path:plugins/pip
robbyrussell/oh-my-zsh path:plugins/python
robbyrussell/oh-my-zsh path:plugins/mvn
robbyrussell/oh-my-zsh path:plugins/scala
robbyrussell/oh-my-zsh path:plugins/sbt
robbyrussell/oh-my-zsh path:plugins/git
robbyrussell/oh-my-zsh path:plugins/git-extras
robbyrussell/oh-my-zsh path:plugins/github
robbyrussell/oh-my-zsh path:plugins/gitignore
robbyrussell/oh-my-zsh path:plugins/gitfast
robbyrussell/oh-my-zsh path:plugins/git-flow
robbyrussell/oh-my-zsh path:plugins/git-prompt
robbyrussell/oh-my-zsh path:plugins/git-remote-branch
robbyrussell/oh-my-zsh path:plugins/git-hubflow
robbyrussell/oh-my-zsh path:plugins/sudo
robbyrussell/oh-my-zsh path:plugins/themes
robbyrussell/oh-my-zsh path:plugins/tmux
robbyrussell/oh-my-zsh path:plugins/tmuxinator/tmuxinator.plugin.zsh
robbyrussell/oh-my-zsh path:plugins/tmuxinator/_tmuxinator
robbyrussell/oh-my-zsh path:plugins/battery
robbyrussell/oh-my-zsh path:plugins/urltools
robbyrussell/oh-my-zsh path:plugins/jsontools
robbyrussell/oh-my-zsh path:plugins/zsh_reload
robbyrussell/oh-my-zsh path:plugins/compleat
robbyrussell/oh-my-zsh path:plugins/copydir
robbyrussell/oh-my-zsh path:plugins/copyfile
robbyrussell/oh-my-zsh path:plugins/cp
robbyrussell/oh-my-zsh path:plugins/docker
robbyrussell/oh-my-zsh path:plugins/docker-compose
robbyrussell/oh-my-zsh path:plugins/gem
robbyrussell/oh-my-zsh path:plugins/go
robbyrussell/oh-my-zsh path:plugins/golang
robbyrussell/oh-my-zsh path:plugins/gradle
robbyrussell/oh-my-zsh path:plugins/grunt
robbyrussell/oh-my-zsh path:plugins/history
robbyrussell/oh-my-zsh path:plugins/history-substring-search
robbyrussell/oh-my-zsh path:plugins/lein
robbyrussell/oh-my-zsh path:plugins/rbenv
robbyrussell/oh-my-zsh path:plugins/redis-cli
robbyrussell/oh-my-zsh path:plugins/kubectl
robbyrussell/oh-my-zsh path:plugins/z
robbyrussell/oh-my-zsh path:plugins/web-search
robbyrussell/oh-my-zsh path:plugins/helm
robbyrussell/oh-my-zsh path:plugins/terraform
robbyrussell/oh-my-zsh path:plugins/sublime
robbyrussell/oh-my-zsh path:plugins/dotenv
robbyrussell/oh-my-zsh path:plugins/thefuck
robbyrussell/oh-my-zsh path:plugins/pyenv
robbyrussell/oh-my-zsh path:plugins/npm
robbyrussell/oh-my-zsh path:plugins/asdf

denisidoro/navi

# virtualenv # use pyenv instead
# safe-paste # Conflicts with zsh-completions

# not working
ahmetb/kubectx path:completion/kubectx.zsh kind:fpath
ahmetb/kubectx path:completion/kubens.zsh kind:fpath

Linuxbrew/brew path:completions/zsh kind:fpath

Tarrasch/zsh-autoenv # Other autoenv alternatives: oh-my-zsh/autoenv vs zpm-zsh/autoenv vs cxreg/smartcd vs direnv/direnv
molovo/tipz # Instead of djui/alias-tips
joel-porquet/zsh-dircolors-solarized.git
MichaelAquilina/zsh-autoswitch-virtualenv

# Pugins suggested by unixorn/zsh-quickstart-kit
chrissicool/zsh-256color # Sets your terminal to 256 colors if available.
peterhurford/git-it-on.zsh # Opens your current repo on github, in your current branch.
# supercrabtree/k # k is a directory lister that also shows git status on files & directories.
sharat87/pip-app # A set of shell functions to make it easy to install small apps and utilities distributed with pip.
skx/sysadmin-util # A collection of scripts useful for sysadmins.
RobSis/zsh-completion-generator # Adds tool to generate zsh completion functions for programs missing them by parsing their --help output. Note that this doesn't happen dynamically, you'll have to explicitly create a completion for each command you need one for.
srijanshetty/docker-zsh # Docker completions.
stackexchange/blackbox # Tom Limoncelli's tool for storing secret information in a repository with gnupg encryption, automatically decrypting as needed.
unixorn/bitbucket-git-helpers # Adds git helper scripts for bitbucket.
unixorn/git-extra-commands # Collected extra git helper scripts.
unixorn/rake-completion.zshplugin # Reads your Rakefile to tab complete the Rakefile targets.
unixorn/tumult.plugin.zsh # Adds macOS-specific functions and scripts. This plugin only adds itself to your $PATH if you're on macOS.

# Other important bundles! Mind the order!
zsh-users/zsh-completions
zsh-users/zsh-autosuggestions
zsh-users/zsh-syntax-highlighting
zsh-users/zsh-history-substring-search
psprint/zsh-navigation-tools

# My own customizations
aserrallerios/zsh-files

# Theme
bhilburn/powerlevel9k
